package com.javarush.task.task04.task0431;

/* 
От 10 до 1

Вывести на экран числа от 10 до 1 включительно,
используя цикл while.
Каждое значение с новой строки.
*/

public class Solution {
    public static void main(String[] args) {
        
        int a = 10;
        
        while(a > 0){
            System.out.println(a);
            a = a - 1;
        }
        //напишите тут ваш код
    }
}
