package com.javarush.task.task04.task0430;

/* 
От 1 до 10

Вывести на экран числа от 1 до 10 включительно,
используя цикл while. 
Каждое значение с новой строки.
*/

public class Solution {
    public static void main(String[] args) {
        int a = 1;
        while(a < 11){
            System.out.println(a);
            a = a + 1;
        }
        //напишите тут ваш код

    }
}
