package com.javarush.task.task04.task0433;

/* 
Гадание на долларовый счет

Вывести на экран квадрат из 10х10 букв S используя цикл while.
Буквы в каждой строке не разделять.
*/

public class Solution {
    public static void main(String[] args) {
        
        int n = 10;
        
        while(n > 0){
            System.out.println("SSSSSSSSSS");
            n = n - 1;
        }
        //напишите тут ваш код
    }
}
