package com.javarush.task.task01.task0138;

/* 
Любимое стихотворение

В методе main напиши код, 
чтобы в результате выполнения программы 
было выведено твое любимое стихотворение.
В стихотворении должно быть не меньше, чем 4 строчки.
Не убирай вывод строчки "Мое любимое стихотворение:".
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        System.out.println("Мороз и солнце, день чудесный,");
        System.out.println("Еще ты дремлешь, друг прелестный");
        System.out.println("Пора, красавица, проснись");
        System.out.println("Открой сомкнутые негой взоры");
        //напишите тут ваш код
    }
}
