package com.javarush.task.task03.task0324;

/* 
Меркантильные намерения

Вывести на экран десять раз надпись 
"Я хочу большую зарплату, и для этого изучаю Java"
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        //напишите тут ваш код
    }
}
