package com.javarush.task.task03.task0309;

/* 
Сумма 5 чисел

Вывести на экран сумму чисел от 1 до 5 построчно (должно быть 5 строк):
1
1+2=3
1+2+3=6
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println(1);
        System.out.println(1+2);
        System.out.println(1+2+3);
        System.out.println(1+2+3+4);
        System.out.println(1+2+3+4+5);
        //напишите тут ваш код

    }
}
